Revit 2024 API
IExternalServer.GetVendorId Method
 Implement this method to return the id of the vendor of the server.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
string GetVendorId()
Visual Basic
Function GetVendorId As String
Visual C++
String^ GetVendorId()
Return Value
 Vendor Id of the server.
Remarks
 The Id is expected to be a string consisting of 4 characters.
See Also
IExternalServer Interface
Autodesk.Revit.DB.ExternalService Namespace